Repository: PiotrStyla/Air24-MiniApp
Catalog: lib/l10n2/app_*.arb
Languages: de, es, fr, pl, pt

# appTitle
source: Flight Compensation
de: Flugentschädigung
es: Compensación de Vuelo
fr: Indemnisation de vol
pl: Odszkodowanie za Lot
pt: Compensação de Voo

# welcomeUser
source: Welcome, {name} ({role})
de: Willkommen, {userName}
es: Bienvenido, {userName}
fr: Bienvenue, {userName}
pl: Witaj, {userName}
pt: Bem-vindo, {userName}

source: Sign Out
de: Abmelden
es: Cerrar Sesión
fr: Déconnexion
pl: Wyloguj się
pt: Sair

source: Not Logged In
pl: Nie jesteś zalogowany

source: Sign In
pl: Zaloguj się

source: Delete
de: Löschen
es: Eliminar
fr: Supprimer
pl: Usuń
pt: Excluir

source: New Claim
de: Neuer Anspruch
es: Nueva Reclamación
fr: Nouvelle Réclamation
pl: Nowe Roszczenie
pt: Nova Reclamação

source: Home
de: Startseite
es: Inicio
fr: Accueil
pl: Strona Główna
pt: Início

source: Settings
de: Einstellungen
es: Configuración
fr: Paramètres
pl: Ustawienia
pt: Definições

source: Language Selection
de: Sprache
es: Idioma
fr: Langue
pl: Język
pt: Idioma

source: Passenger Name
de: Name des Passagiers
es: Nombre del Pasajero
fr: Nom du Passager
pl: Imię i Nazwisko Pasażera
pt: Nome do Passageiro

source: Passenger Details
de: Passagierdetails
es: Detalles del Pasajero
fr: Détails du Passager
pl: Dane Pasażera
pt: Detalhes do Passageiro

source: Flight Number
de: Flugnummer
es: Número de Vuelo
fr: Numéro de Vol
pl: Numer lotu:
pt: Número do Voo

source: Airline
de: Fluggesellschaft
es: Aerolínea
fr: Compagnie Aérienne
pl: Linia lotnicza
pt: Companhia Aérea

source: Departure Airport
de: Abflughafen
es: Aeropuerto de Salida
fr: Aéroport de Départ
pl: Lotnisko odlotu:
pt: Aeroporto de Partida

source: Arrival Airport
de: Ankunftsflughafen
es: Aeropuerto de Llegada
fr: Aéroport d'Arrivée
pl: Lotnisko przylotu:
pt: Aeroporto de Chegada

source: Booking Reference
de: Buchungsreferenz
es: Referencia de Reserva
fr: Référence de Réservation
pl: Numer Rezerwacji
pt: Referência da Reserva

source: Additional Information
de: Zusätzliche Informationen
es: Información Adicional
fr: Informations Additionnelles
pl: Dodatkowe Informacje
pt: Informação Adicional

source: Optional
es: (Opcional)
fr: (Optionnel)
pl: (Opcjonalnie)
pt: (Opcional)

source: This field is required
de: Dieses Feld ist erforderlich.
es: Este campo es obligatorio.
fr: Ce champ est requis.
pl: To pole jest wymagane.
pt: Este campo é obrigatório.

source: Please enter departure airport
de: Bitte geben Sie einen Abflughafen ein.
es: Por favor, ingrese un aeropuerto de salida.
fr: Veuillez saisir un aéroport de départ.
pl: Wprowadź lotnisko wylotu
pt: Por favor, introduza um aeroporto de partida.

source: Upload Documents
de: Dokumente hochladen
es: Subir Documentos
fr: Télécharger des Documents
pl: Prześlij Dokumenty
pt: Carregar Documentos

source: Submit Claim
de: Anspruch einreichen
es: Enviar Reclamación
fr: Soumettre la Réclamation
pl: Złóż Roszczenie
pt: Submeter Reclamação

source: Add Document
de: Dokument hinzufügen
es: Añadir Documento
fr: Ajouter un Document
pl: Dodaj Dokument
pt: Adicionar Documento

source: Claim Submitted Successfully
de: Anspruch erfolgreich eingereicht!
es: ¡Reclamación enviada con éxito!
fr: Réclamation soumise avec succès !
pl: Roszczenie złożone pomyślnie!
pt: Reclamação submetida com sucesso!

source: Complete All Fields
de: Bitte füllen Sie alle Felder aus.
es: Por favor, complete todos los campos.
fr: Veuillez remplir tous les champs.
pl: Proszę wypełnić wszystkie pola.
pt: Por favor, preencha todos os campos.

source: Supporting Documents
de: Unterstützende Dokumente
es: Documentos de Soporte
fr: Documents Justificatifs
pl: Dokumenty Pomocnicze
pt: Documentos de Suporte

source: Crop Document
de: Dokument zuschneiden
es: Recortar Documento
fr: Rogner le Document
pl: Przytnij Dokument
pt: Recortar Documento

source: Crop
de: Zuschneiden
es: Recortar
fr: Rogner
pl: Przytnij
pt: Recortar

source: Rotate
de: Drehen
es: Girar
fr: Pivoter
pl: Obróć
pt: Rodar

source: Aspect Ratio
de: Seitenverhältnis
es: Relación de Aspecto
fr: Ratio d'Aspect
pl: Proporcje Obrazu
pt: Proporção

source: Document OCR Result
de: OCR-Ergebnis
es: Resultado OCR
fr: Résultat OCR
pl: Wynik OCR
pt: Resultado OCR

source: Extracted Fields
de: Extrahierte Felder
es: Campos Extraídos
fr: Champs Extraits
pl: Wyodrębnione Pola
pt: Campos Extraídos

source: Full Text
de: Volltext
es: Texto Completo
fr: Texte Complet
pl: Pełny Tekst
pt: Texto Completo

source: Document Saved
de: Dokument gespeichert.
es: Documento guardado.
fr: Document sauvegardé.
pl: Dokument zapisany.
pt: Documento guardado.

source: Use Extracted Data
de: Extrahierte Daten verwenden
es: Usar Datos Extraídos
fr: Utiliser les Données Extraites
pl: Użyj Wyodrębnionych Danych
pt: Usar Dados Extraídos

source: Copy to Clipboard
de: In die Zwischenablage kopiert.
es: Copiado al portapapeles.
fr: Copié dans le presse-papiers.
pl: Skopiowano do schowka.
pt: Copiado para a área de transferência.

source: Document Type
de: Dokumententyp
es: Tipo de Documento
fr: Type de Document
pl: Typ Dokumentu
pt: Tipo de Documento

source: Save Document
de: Dokument speichern
es: Guardar Documento
fr: Sauvegarder le Document
pl: Zapisz Dokument
pt: Guardar Documento

source: Field Name
de: Feldname
es: Nombre del Campo
fr: Nom du Champ
pl: Nazwa Pola
pt: Nome do Campo

source: Yes
de: Ja
es: Sí
fr: Oui
pl: Tak
pt: Sim

source: No
de: Nein
fr: Non
pl: Nie
pt: Não

source: Back
de: Zurück
es: Atrás
fr: Retour
pl: Wstecz
pt: Voltar

source: Save
de: Speichern
es: Guardar
fr: Sauvegarder
pl: Zapisz
pt: Guardar

# welcomeMessage
source: Welcome
de: Willkommen in der App!
es: ¡Bienvenido a la aplicación!
fr: Bienvenue dans l'application !
pl: Witamy w aplikacji!
pt: Bem-vindo à aplicação!

source: No Fields Extracted
de: Es wurden keine Felder aus dem Dokument extrahiert.
es: No se extrajeron campos del documento.
fr: Aucun champ n'a été extrait du document.
pl: Nie wyodrębniono żadnych pól z dokumentu.
pt: Nenhum campo foi extraído do documento.

source: Claims
de: Ansprüche
es: Reclamaciones
fr: Réclamations
pl: Roszczenia
pt: Reclamações

source: No Claims Yet
de: Noch keine Ansprüche
es: Aún no hay reclamaciones
fr: Aucune réclamation pour le moment
pl: Brak zgłoszeń
pt: Ainda não há solicitações

# startCompensationClaimInstructions
source: Start by creating a new compensation claim for your flight. We'll guide you through the process.
de: Starten Sie Ihren Entschädigungsantrag, indem Sie einen Flug aus dem Bereich 'EU-berechtigte Flüge' auswählen
es: Inicie su reclamación de compensación seleccionando un vuelo en la sección Vuelos elegibles para la UE
fr: Commencez votre demande d'indemnisation en sélectionnant un vol dans la section Vols Éligibles de l'UE
pl: Rozpocznij zgłoszenie odszkodowania, wybierając lot z sekcji Loty kwalifikujące się w UE
pt: Inicie sua solicitação de compensação selecionando um voo na seção Voos elegíveis para a UE

source: Active
de: Aktiv
es: Activa
pl: Aktywne
pt: Ativa

source: Action Required
de: Handlung erforderlich
es: Acción Requerida
fr: Action Requise
pl: Wymagana akcja
pt: Ação Necessária

source: Completed
de: Abgeschlossen
es: Completada
fr: Terminée
pl: Ukończone
pt: Concluída

# profileInfoCardTitle
source: Personal Information
de: Ihr Profil enthält Ihre persönlichen Daten und Kontaktinformationen. Diese werden verwendet, um Ihre Entschädigungsansprüche für Flüge zu bearbeiten und Sie über den Fortschritt auf dem Laufenden zu halten.
es: Su perfil contiene su información personal y de contacto. Esto se utiliza para procesar sus reclamaciones de compensación de vuelo y mantenerlo informado.
fr: Votre profil contient vos informations personnelles et de contact. Celles-ci sont utilisées pour traiter vos demandes d'indemnisation de vol et vous tenir informé.
pl: Twój profil zawiera Twoje dane osobowe i kontaktowe. Są one wykorzystywane do przetwarzania Twoich roszczeń o odszkodowanie za lot i informowania Cię o postępach.
pt: O seu perfil contém as suas informações pessoais e de contacto. Estas são usadas para processar as suas reclamações de compensação de voo e mantê-lo informado.

source: Account Settings
de: Kontoeinstellungen
es: Configuración de la Cuenta
fr: Paramètres du Compte
pl: Ustawienia Konta
pt: Definições da Conta

source: Accessibility Options
de: Barrierefreiheitsoptionen
es: Opciones de accesibilidad
fr: Options d'Accessibilité
pl: Opcje Dostępności
pt: Opções de acessibilidade

# configureAccessibilityDescription
source: Adjust text size, contrast, and other accessibility features
de: Konfigurieren Sie hohen Kontrast, großen Text und Screenreader-Unterstützung
es: Configurar alto contraste, texto grande y soporte para lector de pantalla
fr: Configurer le contraste élevé, le grand texte et le support du lecteur d'écran
pl: Skonfiguruj wysoki kontrast, duży tekst i obsługę czytnika ekranu
pt: Configurar contraste elevado, texto grande e suporte para leitor de ecrã

# configureNotificationsDescription
source: Receive updates about claim status and important information
de: Konfigurieren Sie, wie Sie Anspruchsaktualisierungen erhalten
es: Configurar cómo recibe las actualizaciones de las reclamaciones
fr: Configurer la manière dont vous recevez les mises à jour des réclamations
pl: Skonfiguruj sposób otrzymywania aktualizacji dotyczących roszczeń
pt: Configurar como recebe atualizações de reclamações

# tipProfileUpToDate
source: • Keep your profile up-to-date for faster claim processing.
de: Halten Sie Ihr Profil aktuell
es: Mantenga su perfil actualizado
fr: Gardez votre profil à jour pour un traitement fluide des réclamations.
pl: Utrzymuj swój profil aktualnym
pt: Mantenha seu perfil atualizado

# tipInformationPrivate
source: • Your information is kept private and secure.
de: Ihre Informationen sind privat
es: Su información es privada
fr: Vos informations sont privées et utilisées uniquement pour les demandes d'indemnisation.
pl: Twoje informacje są prywatne
pt: Suas informações são privadas

# tipContactDetails
source: • Correct contact details help with compensation.
de: Kontaktdetails
es: Datos de Contacto
fr: Assurez-vous que vos coordonnées sont correctes afin que nous puissions vous contacter au sujet de votre réclamation.
pl: Dane kontaktowe
pt: Detalhes de Contato

# tipAccessibilitySettings
source: • Configure accessibility settings to customize your experience.
de: Barrierefreiheitseinstellungen
es: Configuración de Accesibilidad
fr: Consultez les paramètres d'accessibilité pour personnaliser l'application selon vos besoins.
pl: Ustawienia dostępności
pt: Configurações de Acessibilidade

source: Cancel
de: Abbrechen
es: Cancelar
fr: Annuler
pl: Anuluj
pt: Cancelar

source: Filter by airline
de: Nach Fluggesellschaft filtern
es: Filtrar por aerolínea
fr: Filtrer par compagnie aérienne
pl: Filtruj według linii lotniczej
pt: Filtrar por companhia aérea

# flightStatusDelayed
source: Delayed
de: Verspätet
es: Retrasado
fr: Retardé
pl: Opóźniony
pt: Atrasado

source: Flight
de: Flug
es: Vuelo
fr: Vol
pl: Lot
pt: Voo

source: Flight Date
de: Flugdatum
es: Fecha del Vuelo
fr: Date du Vol
pl: Data lotu:
pt: Data do Voo

source: Check Compensation Eligibility
de: Entschädigungsberechtigung prüfen
es: Verificar Elegibilidad para Compensación
fr: Vérifier l'Éligibilité à l'Indemnisation
pl: Sprawdź kwalifikowalność do odszkodowania
pt: Verificar Elegibilidade para Compensação

source: Profile Information
de: Profilinformationen
es: Información del Perfil
fr: Informations du Profil
pl: Informacje Profilowe
pt: Informação do Perfil

source: Notification Settings
de: Benachrichtigungseinstellungen
es: Configuración de Notificaciones
fr: Paramètres de Notification
pl: Ustawienia Powiadomień
pt: Definições de Notificação

source: Change Application Language
de: Anwendungssprache ändern
es: Cambiar el idioma de la aplicación
fr: Changer la langue de l'application
pl: Zmień język aplikacji
pt: Alterar idioma da aplicação

source: Tips and Reminders
de: Tipps & Erinnerungen
es: Consejos y Recordatorios
fr: Conseils & Rappels
pl: Wskazówki i Przypomnienia
pt: Dicas e Lembretes

# noClaimsYetTitle
source: No Claims in this Category
de: Noch keine Ansprüche
es: Aún No Hay Reclamaciones
fr: Aucune Réclamation Pour le Moment
pl: Brak Roszczeń
pt: Ainda Não Há Reclamações

source: Phone Number
de: Telefonnummer
es: Número de Teléfono
fr: Numéro de Téléphone
pl: Numer Telefonu
pt: Número de Telefone

source: Required
de: Erforderlich
es: Obligatorio
fr: Requis
pl: Wymagane
pt: Obrigatório

source: Compensation Claim Form
de: Entschädigungsantragsformular
es: Formulario de Reclamación de Compensación
fr: Formulaire de Demande d'Indemnisation
pl: Formularz Roszczenia o Odszkodowanie
pt: Formulário de Reclamação de Compensação

source: Claim Not Found
de: Anspruch nicht gefunden
es: Reclamación no encontrada
fr: Réclamation introuvable
pl: Nie znaleziono roszczenia
pt: Reclamação não encontrada

# claimNotFoundDesc
source: The requested claim could not be found or may have been deleted
de: Der angeforderte Anspruch konnte nicht gefunden werden. Er wurde möglicherweise gelöscht.
es: La reclamación solicitada no se pudo encontrar. Puede que haya sido eliminada.
fr: La réclamation demandée est introuvable. Elle a peut-être été supprimée.
pl: Żądane roszczenie nie zostało znalezione. Mogło zostać usunięte.
pt: A reclamação solicitada não pôde ser encontrada. Pode ter sido excluída.

source: Back to Dashboard
de: Zurück zum Dashboard
es: Volver al panel
fr: Retour au tableau de bord
pl: Powrót do panelu głównego
pt: Voltar ao painel

# tipCheckEligibility
source: Check eligibility before submitting a claim
de: • Stellen Sie sicher, dass Ihr Flug anspruchsberechtigt ist (z. B. Verspätung >3h, Annullierung, Nichtbeförderung).
es: • Asegúrese de que su vuelo sea elegible para compensación (p. ej., retraso >3h, cancelación, denegación de embarque).
fr: • Assurez-vous que votre vol est éligible à une indemnisation (par ex. retard >3h, annulation, refus d'embarquement).
pl: Sprawdź kwalifikowalność według rozporządzenia UE 261/2004 przed złożeniem roszczenia.
pt: • Certifique-se de que o seu voo é elegível para compensação (ex: atraso >3h, cancelamento, recusa de embarque).

# tipDoubleCheckDetails
source: Double-check all flight details before submission
de: • Überprüfen Sie alle Details vor dem Einreichen, um Verzögerungen zu vermeiden.
es: • Verifique todos los detalles antes de enviar para evitar demoras.
fr: • Vérifiez tous les détails avant de soumettre pour éviter les retards.
pl: Dokładnie sprawdź wszystkie szczegóły przed złożeniem roszczenia.
pt: • Verifique todos os detalhes antes de submeter para evitar atrasos.

# tooltipFaqHelp
source: View Frequently Asked Questions
de: Greifen Sie auf die häufig gestellten Fragen und den Hilfebereich zu
es: Acceder a las preguntas frecuentes y la sección de ayuda
fr: Accéder à la foire aux questions et à la section d'aide
pl: Zobacz pomoc FAQ
pt: Aceder às perguntas frequentes e secção de ajuda

source: Submit New Claim
de: Neuen Anspruch einreichen
es: Enviar nueva reclamación
pl: Złóż nowe roszczenie

source: Reason for Claim
de: Grund für den Anspruch
es: Motivo de la reclamación
fr: Motif de la Réclamation
pl: Powód reklamacji:
pt: Motivo da Reclamação

# flightCancellationReason
source: Flight cancellation - requesting compensation under EU261 regulation for cancelled flight
fr: Annulation de vol - demande d'indemnisation au titre du règlement EU261 pour vol annulé
pl: Odwołanie lotu - wniosek o odszkodowanie na podstawie rozporządzenia UE 261 za odwołany lot
pt: Cancelamento de voo - solicitando compensação sob o regulamento EU261 por voo cancelado

# flightDelayReason
source: Flight delay over 3 hours - requesting compensation under EU261 regulation for significant delay
fr: Retard de vol supérieur à 3 heures - demande d'indemnisation au titre du règlement EU261 pour retard important
pl: Opóźnienie lotu powyżej 3 godzin - wniosek o odszkodowanie na podstawie rozporządzenia UE 261 za znaczne opóźnienie
pt: Atraso de voo superior a 3 horas - solicitando compensação sob o regulamento EU261 por atraso significativo

# flightDiversionReason
source: Flight diversion - requesting compensation under EU261 regulation for diverted flight
fr: Déroutement de vol - demande d'indemnisation au titre du règlement EU261 pour vol dérouté
pl: Przekierowanie lotu - wniosek o odszkodowanie na podstawie rozporządzenia UE 261 za przekierowany lot
pt: Desvio de voo - solicitando compensação sob o regulamento EU261 por voo desviado

# eu261CompensationReason
source: Requesting compensation under EU261 regulation for flight disruption
fr: Demande d'indemnisation au titre du règlement EU261 pour perturbation de vol
pl: Wniosek o odszkodowanie na podstawie rozporządzenia UE 261 za zakłócenie lotu
pt: Solicitando compensação sob o regulamento EU261 por interrupção de voo

# flightDateHint
source: Select flight date
de: Flugdatum (JJJJ-MM-TT)
es: Seleccionar fecha del vuelo
pl: Wybierz datę swojego lotu

# pleaseEnterFlightNumber
source: Please enter a flight number
de: Bitte geben Sie eine Flugnummer ein
es: Por favor, ingrese un número de vuelo
fr: Veuillez entrer un numéro de vol
pl: Proszę podać numer lotu
pt: Por favor insira um número de voo

source: Please enter arrival airport
de: Bitte geben Sie einen Ankunftsflughafen ein
es: Por favor, introduce el aeropuerto de llegada
pl: Wprowadź lotnisko przylotu

# pleaseEnterReason
source: Please enter reason for claim
de: Bitte geben Sie einen Grund ein
es: Por favor, introduce un motivo para la reclamación
pl: Wprowadź powód roszczenia

# pleaseSelectFlightDate
source: Please select a flight date
de: Bitte wählen Sie ein Flugdatum
es: Por favor, selecciona la fecha del vuelo
pl: Proszę wybrać datę lotu.

source: Claim Details
de: Anspruchsdetails
es: Detalles de la reclamación
fr: Détails de la Réclamation
pl: Szczegóły roszczenia
pt: Detalhes da Reclamação

source: Refresh
de: Aktualisieren
es: Actualizar
fr: Actualiser
pl: Odśwież
pt: Atualizar

source: Error Loading Claim
de: Fehler beim Laden des Anspruchs
es: Error al cargar la reclamación
fr: Erreur lors du Chargement de la Réclamation
pl: Błąd ładowania roszczenia
pt: Erro ao Carregar Reclamação

source: Retry
de: Wiederholen
es: Reintentar
fr: Réessayer
pl: Spróbuj ponownie
pt: Tentar novamente

source: Unknown error
de: Unbekannter Fehler
es: Error desconocido
fr: Erreur inconnue
pl: Nieznany błąd
pt: Erro desconhecido

# formSubmissionError
source: Form submission error: {error}
de: Fehler beim Senden des Formulars: {errorMessage}. Bitte überprüfen Sie Ihre Verbindung und versuchen Sie es erneut.
es: Error al enviar el formulario: {errorMessage}. Verifique su conexión e inténtelo de nuevo.
fr: Erreur lors de la soumission du formulaire : {error}. Veuillez vérifier votre connexion et réessayer.
pl: Błąd podczas wysyłania formularza: {error}. Sprawdź połączenie i spróbuj ponownie.
pt: Erro ao submeter o formulário: {error}. Verifique a sua ligação e tente novamente.

source: Field Value
de: Feldwert
es: Valor del Campo
fr: Valeur du Champ
pl: Wartość Pola
pt: Valor do Campo

# errorConnectionFailed
source: Connection failed
de: Verbindung fehlgeschlagen. Bitte überprüfen Sie Ihr Netzwerk.
es: Falló la conexión. Por favor, revise su red.
fr: Échec de la connexion. Veuillez vérifier votre réseau.
pl: Błąd połączenia. Sprawdź swoje połączenie sieciowe.
pt: Falha na ligação. Por favor, verifique a sua rede.

# lastHours
source: Last {hours} Hours
de: Letzte {hours} Stunden
es: Últimas {hours} horas
fr: Dernières {hours} heures
pl: Ostatnie {hours} godziny
pt: Últimas {hours} horas

# noFlightsMatchingFilter
source: No flights matching filter: {filter}
de: Keine Flüge entsprechen dem Filter: {filter}
es: No hay vuelos que coincidan con el filtro: {filter}
fr: Aucun vol correspondant au filtre : {filter}
pl: Brak lotów spełniających filtr: {filter}
pt: Nenhum voo corresponde ao filtro: {filter}

source: Force Refresh Data
de: Datenaktualisierung erzwingen
es: Forzar actualización de datos
fr: Forcer l’actualisation des données
pl: Wymuś odświeżenie danych
pt: Forçar atualização de dados

source: Forcing fresh data load...
de: Erzwinge eine neue Datenaktualisierung...
es: Forzando una nueva carga de datos...
fr: Forçage du chargement des données…
pl: Wymuszanie ponownego ładowania danych...
pt: Forçando uma nova atualização de dados...

source: Check Again
de: Erneut prüfen
es: Volver a comprobar
fr: Vérifier à nouveau
pl: Sprawdź ponownie
pt: Verificar novamente

source: EU-Wide Compensation Eligible Flights
de: EU-Entschädigungsberechtigte Flüge
es: Vuelos elegibles para compensación en la UE
fr: Vols éligibles à la compensation européenne
pl: Loty kwalifikujące się do odszkodowania w UE
pt: Voos elegíveis para compensação na UE

source: No Eligible Flights Found
de: Keine berechtigten Flüge gefunden
es: No se encontraron vuelos elegibles
fr: Aucun vol éligible trouvé
pl: Nie znaleziono kwalifikujących się lotów
pt: Nenhum voo elegível encontrado

# noEligibleFlightsDescription
source: No flights eligible for EU compensation were found in the last {hours} hours. Check again later.
de: Keine Flüge in den letzten {hours} Stunden gefunden.
es: No se encontraron vuelos en las últimas {hours} horas.
fr: Aucun vol éligible à la compensation UE n’a été trouvé au cours des dernières {hours} heures. Réessayez plus tard.
pl: Nie znaleziono lotów z ostatnich {hours} godzin.
pt: Nenhum voo encontrado nas últimas {hours} horas.

source: API Connection Issue
de: API-Verbindungsproblem. Bitte versuchen Sie es erneut.
es: Problema de conexión con la API. Por favor, inténtelo de nuevo.
fr: Problème de connexion à l’API
pl: Problem z połączeniem z API. Spróbuj ponownie.
pt: Problema de conexão com a API. Por favor, tente novamente.

# createClaim
source: Create New Claim
de: Anspruch erstellen
es: Crear reclamación
fr: Créer une nouvelle réclamation
pl: Utwórz zgłoszenie
pt: Criar solicitação

source: Submitted
de: Eingereicht
es: Enviado
fr: Soumise
pl: Wysłane
pt: Enviado

source: In Review
de: In Überprüfung
es: En revisión
fr: En cours d’examen
pl: W trakcie weryfikacji
pt: Em análise

source: Processing
de: In Bearbeitung
es: Procesando
fr: Traitement en cours
pl: Przetwarzanie
pt: Processando

source: Approved
de: Genehmigt
es: Aprobado
fr: Approuvée
pl: Zatwierdzone
pt: Aprovado

source: Rejected
de: Abgelehnt
es: Rechazado
fr: Rejetée
pl: Odrzucone
pt: Rejeitado

source: Paid
de: Ausbezahlt
es: Pagado
fr: Payée
pl: Wypłacone
pt: Pago

source: Under Appeal
de: Im Einspruchsverfahren
es: En apelación
fr: En appel
pl: W odwołaniu
pt: Em recurso

source: Unknown
de: Unbekannt
es: Desconocido
fr: Inconnu
pl: Nieznany
pt: Desconhecido

source: Authentication Required
de: Authentifizierung erforderlich
es: Autenticación Requerida
fr: Authentification requise
pl: Wymagane uwierzytelnienie
pt: Autenticação Necessária

source: Error loading claims
de: Fehler beim Laden der Ansprüche
es: Error al cargar las reclamaciones
fr: Erreur lors du chargement des réclamations
pl: Błąd ładowania zgłoszeń
pt: Erro ao carregar solicitações

# loginToViewClaimsDashboard
source: Please log in to view your claims dashboard
de: Bitte melden Sie sich an, um Ihr Anspruchs-Dashboard anzuzeigen
es: Por favor, inicie sesión para ver su panel de reclamaciones
fr: Connectez-vous pour voir votre tableau de bord des réclamations
pl: Zaloguj się, aby zobaczyć swój pulpit zgłoszeń
pt: Por favor, faça login para ver o seu painel de solicitações

source: Log In
de: Anmelden
es: Iniciar sesión
fr: Se connecter
pl: Zaloguj się
pt: Entrar

# claimForFlight
source: Claim for flight {flightNumber} - {status}
de: Anspruch für Flug {number} - {status}
es: Reclamación para el vuelo {number} - {status}
pl: Zgłoszenie dla lotu {flightNumber} - {status}
pt: Solicitação para voo {flightNumber} - {status}
