Repository: PiotrStyla/Air24-MiniApp
Catalog: lib/l10n2/app_*.arb
Languages: de, es, fr, pl, pt

source: Copied to Clipboard
de: In die Zwischenablage kopiert
es: Copiado al portapapeles
fr: Copié dans le presse-papiers
pl: TODO: Translate 'Copied to Clipboard'
pt: Copiado para a área de transferência

source: Network Error
de: Netzwerkfehler
es: Error de red
fr: Erreur réseau
pl: TODO: Translate 'Network Error'
pt: Erro de rede

source: General Error
de: Allgemeiner Fehler
es: Error general
fr: Erreur générale
pl: TODO: Translate 'General Error'
pt: Erro geral

source: Login Required for Claim
de: Anmeldung erforderlich, um einen Anspruch einzureichen
es: Se requiere inicio de sesión para presentar una reclamación
fr: Connexion requise pour la réclamation
pl: TODO: Translate 'Login Required for Claim'
pt: Login necessário para enviar a reclamação

source: Email Address
fr: Adresse e-mail
pl: TODO: Translate 'Email Address'
pt: Endereço de e-mail

source: Passenger Information
fr: Informations du passager
pl: TODO: Translate 'Passenger Information'
pt: Informações do passageiro

# validatorReasonRequired
source: Reason for claim is required
de: Grund ist erforderlich
es: Motivo es obligatorio
fr: Le motif de la réclamation est obligatoire
pl: Powód roszczenia jest wymagany
pt: O motivo da reclamação é obrigatório

source: Continue to Review
de: Weiter zur Überprüfung
es: Continuar a revisión
fr: Continuer à la révision
pl: Przejdź do przeglądu
pt: Continuar para revisão

# validatorArrivalAirportRequired
source: Arrival airport is required
de: Ankunftsflughafen ist erforderlich
es: Aeropuerto de llegada es obligatorio
fr: L'aéroport d'arrivée est obligatoire
pl: TODO: Translate 'Arrival airport is required'
pt: O aeroporto de chegada é obrigatório

# validatorFlightNumberRequired
source: Flight number is required
de: Flugnummer ist erforderlich
es: Número de vuelo es obligatorio
fr: Le numéro de vol est obligatoire
pl: TODO: Translate 'Flight number is required'
pt: O número do voo é obrigatório

# validatorDepartureAirportRequired
source: Departure airport is required
de: Abflughafen ist erforderlich
es: Aeropuerto de salida es obligatorio
fr: L’aéroport de départ est requis
pl: TODO: Translate 'Departure airport is required'
pt: O aeroporto de partida é obrigatório

# errorMustBeLoggedIn
source: You must be logged in to submit a claim
de: Sie müssen angemeldet sein, um diese Aktion durchzuführen
es: Debe iniciar sesión para realizar esta acción
fr: Vous devez être connecté pour soumettre une réclamation
pl: TODO: Translate 'You must be logged in to submit a claim'
pt: Você deve estar conectado para enviar uma reclamação

# dialogTitleError
source: Error
de: Fehler
fr: Erreur
pl: TODO: Translate 'Error'
pt: Erro

# flightCompensationCheckerTitle
source: Flight Compensation Checker
de: Flugentschädigungs-Prüfer
es: Verificador de Compensación de Vuelos
fr: Vérificateur d'indemnisation de vol
pl: Sprawdzanie odszkodowania za lot
pt: Verificador de Compensação de Voo

# checkEligibilityForEu261
source: Check Eligibility for EU 261 Compensation
de: Prüfen Sie, ob Ihr Flug für eine EU261-Entschädigung in Frage kommt
es: Verifique si su vuelo es elegible para compensación según la normativa EU261
fr: Vérifier l'éligibilité pour la compensation EU 261
pl: Sprawdź uprawnienia do odszkodowania EU 261
pt: Verificar elegibilidade para compensação EU 261

# flightNumberPlaceholder
source: Flight Number (e.g., LO123)
de: Flugnummer (z.B. LH123)
es: Número de vuelo (ej. IB123)
fr: Numéro de vol (ex. LO123)
pl: Numer lotu (np. LO123)
pt: Número do voo (ex. LO123)

# dateOptionalPlaceholder
source: Flight Date (optional)
de: Datum (JJJJ-MM-TT, optional)
es: Fecha (AAAA-MM-DD, opcional)
fr: Date du vol (optionnel)
pl: Data lotu (opcjonalnie)
pt: Data do voo (opcional)

# leaveDateEmptyForToday
source: Leave empty for today's date
de: Leer lassen für heute
es: Dejar en blanco para hoy
fr: Laisser vide pour la date d'aujourd'hui
pl: Pozostaw puste dla dzisiejszej daty
pt: Deixe em branco para a data de hoje

source: Support Our Mission
fr: Soutenez Notre Mission
pl: Wesprzyj naszą misję
pt: Apoie Nossa Missão

# helpKeepAppFree
source: Help us keep this app free and support hospice care
fr: Aidez-nous à garder cette application gratuite et à soutenir les soins palliatifs
pl: Pomóż nam utrzymać tę aplikację bezpłatną i wesprzyj opiekę hospicyjną
pt: Ajude-nos a manter este aplicativo gratuito e apoiar cuidados paliativos

# yourContributionMakesDifference
source: Your contribution makes a difference
fr: Votre contribution fait la différence
pl: Twoja darowizna ma znaczenie
pt: Sua contribuição faz a diferença

source: Hospice Foundation
pl: Fundacja Hospicyjna

source: App Development
pl: Rozwój Aplikacji

# comfortCareForPatients
source: Comfort and care for patients
pl: Opieka i komfort dla pacjentów

source: New features and improvements
fr: Nouvelles fonctionnalités et améliorations
pl: Nowe funkcje i ulepszenia
pt: Novos recursos e melhorias

source: Choose your support amount:
pl: Wybierz kwotę wsparcia:

source: Total Donation
pl: Całkowita Darowizna

source: Donation Summary
pl: Podsumowanie Darowizny

source: Choose payment method:
fr: Choisissez une méthode de paiement:
pl: Wybierz metodę płatności:
pt: Escolha o método de pagamento:

source: Payment Method
fr: Méthode de Paiement
pl: Metoda płatności
pt: Método de Pagamento

source: Credit/Debit Card
fr: Carte de Crédit/Débit
pl: Karta kredytowa/debetowa
pt: Cartão de Crédito/Débito

# payWithPayPalAccount
source: Pay with your PayPal account
fr: Payez avec votre compte PayPal
pl: Płać za pomocą konta PayPal
pt: Pagar com sua conta PayPal

source: Not available on this device
pl: Niedostępne na tym urządzeniu

source: Quick and secure
fr: Rapide et sécurisé
pl: Szybko i bezpiecznie
pt: Rápido e seguro

source: Small Support
fr: Petit Soutien
pl: Małe Wsparcie
pt: Pequeno Apoio

source: Good Support
fr: Bon Soutien
pl: Dobre Wsparcie
pt: Bom Apoio

source: Great Support
fr: Grand Soutien
pl: Świetne Wsparcie
pt: Grande Apoio

source: Your {amount} helps:
fr: Votre {amount} aide:
pl: Twoje {amount} pomaga:
pt: Seu {amount} ajuda:

source: Hospice patient care
fr: Soins aux patients en hospice
pl: Opieka nad pacjentami hospicjum
pt: Cuidados com pacientes de hospício

source: App improvements
fr: Améliorations de l'application
pl: Ulepszenia aplikacji
pt: Melhorias do aplicativo

source: Continue with {amount}
fr: Continuer avec {amount}
pl: Kontynuuj z {amount}
pt: Continuar com {amount}

source: Select an amount
pl: Wybierz kwotę

source: Maybe Later
fr: Peut-être plus tard
pl: Może później
pt: Talvez mais tarde

# securePaymentInfo
source: Secure payment • No hidden fees • Tax receipt
pl: Bezpieczna płatność • Brak ukrytych opłat • Paragon podatkowy

# learnMoreHospiceFoundation
source: Learn more about Hospice Foundation: fundacja-hospicjum.org
fr: En savoir plus sur la Fondation Hospice: fundacja-hospicjum.org
pl: Dowiedz się więcej o Fundacji Hospicyjnej: fundacja-hospicjum.org
pt: Saiba mais sobre a Fundação Hospício: fundacja-hospicjum.org

source: Touch ID or Face ID
fr: Touch ID ou Face ID
pl: Touch ID lub Face ID
pt: Touch ID ou Face ID

source: Continue to Payment
fr: Continuer vers le Paiement
pl: Przejdź do płatności
pt: Continuar para Pagamento

source: Select a payment method
fr: Sélectionnez une méthode de paiement
pl: Wybierz metodę płatności
pt: Selecione um método de pagamento

source: Secure Payment
fr: Paiement Sécurisé
pl: Bezpieczna płatność
pt: Pagamento Seguro

# paymentSecurityInfo
source: Your payment information is encrypted and secure. We do not store your payment details.
fr: Vos informations de paiement sont chiffrées et sécurisées. Nous ne stockons pas les détails de votre paiement.
pl: Twoje informacje płatnicze są zaszyfrowane i bezpieczne. Nie przechowujemy szczegółów Twojej płatności.
pt: Suas informações de pagamento são criptografadas e seguras. Não armazenamos os detalhes do seu pagamento.

# taxReceiptEmail
source: Tax receipt will be sent to your email
fr: Le reçu fiscal sera envoyé à votre email
pl: Paragon podatkowy zostanie wysłany na Twój email
pt: O recibo fiscal será enviado para o seu email

# notAvailableOnDevice
source: Not available on this device
fr: Non disponible sur cet appareil
pl: Niedostępne na tym urządzeniu
pt: Não disponível neste dispositivo

source: Comfort and care for patients
fr: Confort et soins pour les patients
pl: Komfort i opieka dla pacjentów
pt: Conforto e cuidado para pacientes

# chooseSupportAmount
source: Choose your support amount:
fr: Choisissez votre montant de soutien:
pl: Wybierz kwotę wsparcia:
pt: Escolha o valor do seu apoio:

# statusLabel
source: Status
es: Estado:
fr: Statut :
pt: Estado:

# emailReadyTitle
source: Your Compensation Email is Ready to Send!
fr: Votre Email d’indemnisation est prêt à être envoyé !
pt: O seu email de compensação está pronto para ser enviado!

source: Send Email Securely
fr: Envoyer l'Email en toute sécurité
pt: Enviar email com segurança

# emailWillBeSentSecurely
source: Your email will be sent securely through our backend service
fr: Votre email sera envoyé en toute sécurité via notre service backend
pt: O seu email será enviado com segurança através do nosso serviço backend

# secureTransmissionNotice
source: Your email will be sent securely using encrypted transmission
fr: Votre email sera envoyé en toute sécurité via une transmission chiffrée
pt: O seu email será enviado com segurança utilizando transmissão cifrada

source: Email
es: Correo Electrónico

source: OK
es: Aceptar

# flightInfoFormat
source: Flight {flightCode} on {flightDate}
de: Flug {flightNumber} - {airline}
es: Vuelo {flightNumber} - {airline}

source: Status
es: Estado

source: From
de: Von
es: Desde

source: To
de: Nach
es: Hasta

source: Delay
de: Verspätung
es: Retraso

# minutesFormat
source: {minutes} minutes
de: {minutes} Minuten
es: {minutes} minutos

source: Flight Eligible For Compensation
de: Ihr Flug hat Anspruch auf Entschädigung!
es: ¡Su vuelo es elegible para compensación!

source: Contact Airline for Claim
de: Kontaktieren Sie die Fluggesellschaft, um Ihre Entschädigung gemäß EU-Verordnung 261/2004 zu beantragen.
es: Contacte a la aerolínea para reclamar su compensación según el Reglamento UE 261/2004.
