Repository: PiotrStyla/Air24-MiniApp
Catalog: lib/l10n2/app_*.arb
Languages: de, es, fr, pl, pt

# flightRouteDetails
source: {departure} to {arrival}
de: Flug {number}: {departure} - {arrival}
es: Vuelo {number}: {departure} - {arrival}
fr: {departure} vers {arrival}
pl: Lot {flightNumber}: {departure} - {arrival}
pt: Voo {flightNumber}: {departure} - {arrival}

source: View claim details
de: Anspruchsdetails anzeigen
es: Ver detalles de la reclamación
pl: Wyświetl szczegóły zgłoszenia
pt: Ver detalhes da solicitação

source: Total Compensation
de: Gesamtentschädigung
es: Compensación Total
pl: Łączna rekompensata
pt: Compensação Total

source: Pending Amount
de: Ausstehender Betrag
es: Monto Pendiente
pl: Kwota oczekująca
pt: Valor Pendente

source: Pending
de: Ausstehend
es: Pendiente
pl: Oczekujące
pt: Pendente

source: Claims Dashboard
de: Anspruchsdashboard
es: Panel de Reclamaciones
pl: Panel zgłoszeń
pt: Painel de Solicitações

source: Refresh Dashboard
de: Dashboard aktualisieren
es: Actualizar Panel
pl: Odśwież panel
pt: Atualizar Painel

source: Claims Summary
de: Anspruchsübersicht
es: Resumen de Reclamaciones
pl: Podsumowanie zgłoszeń
pt: Resumo das Solicitações

source: Total Claims
de: Gesamte Ansprüche
es: Total de Reclamaciones
pl: Wszystkie zgłoszenia
pt: Total de Solicitações

source: Accessibility Settings
de: Barrierefreiheitseinstellungen
es: Configuración de accesibilidad
pl: Ustawienia dostępności
pt: Configurações de acessibilidade

source: Configure Accessibility
de: Barrierefreiheitsoptionen konfigurieren
es: Configurar opciones de accesibilidad
pl: Konfiguruj opcje dostępności
pt: Configurar opções de acessibilidade

source: Configure Notifications
de: Benachrichtigungen konfigurieren
es: Configurar notificaciones
pl: Konfiguruj powiadomienia
pt: Configurar notificações

source: Notification settings coming soon!
de: Benachrichtigungseinstellungen kommen bald!
es: ¡Configuración de notificaciones próximamente!
pl: Ustawienia powiadomień wkrótce!
pt: Configurações de notificações em breve!

source: Select Language
de: Sprache auswählen
es: Seleccionar Idioma
pl: Wybierz język
pt: Selecionar Idioma

# editPersonalInfo
source: Edit Personal Information
de: Persönliche Informationen bearbeiten
es: Editar Información Personal
pl: Edytuj dane osobowe
pt: Editar Informações Pessoais

# editPersonalInfoDescription
source: Update your name, email, and other personal details
de: Aktualisieren Sie Ihre persönlichen Daten, Adresse und Kontaktinformationen
es: Actualice sus datos personales, dirección e información de contacto
pl: Zaktualizuj swoje dane osobowe, adres i informacje kontaktowe
pt: Atualize seus dados pessoais, endereço e informações de contato

# errorSigningOut
source: Error signing out: {error}
de: Fehler beim Abmelden: {error}
es: Error al cerrar sesión: {error}
pl: Błąd podczas wylogowywania: {error}
pt: Erro ao sair: {error}

source: Generic User
de: Benutzer
es: Usuario
pl: Użytkownik
pt: Usuário

source: Loading External Data
fr: Chargement des données externes
pl: Pobieranie danych o lotach...
pt: Carregando Dados Externos

# loadingExternalDataDescription
source: Please wait while we fetch the latest flight data...
fr: Veuillez patienter pendant que nous récupérons les dernières données de vol…
pl: Łączenie z bazami danych lotów. To może chwilę potrwać.
pt: Aguarde enquanto buscamos os dados de voo mais recentes...

# continueToAttachmentsButton
source: Continue to Attachments
de: Weiter zu den Anhängen
es: Continuar a los archivos adjuntos
fr: Continuer vers les pièces jointes
pl: Przejdź do załączników
pt: Continuar para Anexos

source: Country
de: Land
es: País
pl: Kraj
pt: País

source: Privacy Settings
de: Datenschutzeinstellungen
es: Configuración de Privacidad
pl: Ustawienia prywatności
pt: Configurações de Privacidade

# consentToShareData
source: I consent to share my data for claim processing
de: Einwilligung zur Datenweitergabe
es: Consentimiento para Compartir Datos
pl: Zgoda na udostępnianie danych
pt: Consentimento para Compartilhar Dados

# requiredForProcessing
source: Required for processing your claim
de: Erforderlich für die Bearbeitung Ihrer Ansprüche
es: Requerido para procesar sus reclamaciones
pl: Wymagane do przetwarzania roszczeń
pt: Necessário para processar suas solicitações

source: Receive Notifications
de: Benachrichtigungen erhalten
es: Recibir Notificaciones
pl: Otrzymuj powiadomienia
pt: Receber Notificações

source: Get Claim Updates
de: Erhalten Sie Updates zu Ihren Ansprüchen
es: Reciba actualizaciones sobre sus reclamaciones
pl: Otrzymuj aktualizacje dotyczące roszczeń
pt: Receba atualizações sobre suas solicitações

source: Save Profile
de: Profil speichern
es: Guardar Perfil
pl: Zapisz profil
pt: Salvar Perfil

source: Passport Number
de: Passnummer
es: Número de Pasaporte
pl: Numer paszportu
pt: Número do Passaporte

source: Nationality
de: Nationalität
es: Nacionalidad
pl: Narodowość
pt: Nacionalidade

source: Date of Birth
de: Geburtsdatum
es: Fecha de Nacimiento
pl: Data urodzenia
pt: Data de Nascimento

# dateFormat
source: DD/MM/YYYY
de: TT/MM/JJJJ
es: DD/MM/AAAA
pl: DD/MM/RRRR
pt: DD/MM/AAAA

source: Address
de: Adresse
es: Dirección
pl: Adres
pt: Endereço

source: City
de: Stadt
es: Ciudad
pl: Miasto
pt: Cidade

source: Postal Code
de: Postleitzahl
es: Código Postal
pl: Kod pocztowy
pt: Código Postal

source: Error loading profile
de: Fehler beim Laden des Profils
es: Error al cargar el perfil
pl: Błąd podczas ładowania profilu
pt: Erro ao carregar perfil

source: Profile saved
de: Profil erfolgreich gespeichert
es: Perfil guardado con éxito
pl: Profil zapisany pomyślnie
pt: Perfil salvo com sucesso

source: Edit Profile
de: Profil bearbeiten
es: Editar Perfil
pl: Edytuj profil
pt: Editar Perfil

# profileAccuracyInfo
source: Please ensure your profile information is accurate for claim processing
de: Bitte stellen Sie sicher, dass Ihre Profilinformationen korrekt sind
es: Por favor, asegúrese de que la información de su perfil sea precisa
pl: Upewnij się, że informacje w profilu są dokładne
pt: Por favor, certifique-se de que as informações do seu perfil estão precisas

# keepProfileUpToDate
source: Keep your profile up to date
de: Halten Sie Ihr Profil aktuell
es: Mantenga su perfil actualizado
pl: Aktualizuj swój profil na bieżąco
pt: Mantenha seu perfil atualizado

# profilePrivacy
source: Your data is secure and only used for claim processing
de: Wir schützen Ihre Privatsphäre und Daten
es: Protegemos su privacidad y datos
pl: Chronimy Twoją prywatność i dane
pt: Protegemos sua privacidade e dados

# correctContactDetails
source: Ensure contact details are correct
de: Korrekte Kontaktdaten helfen bei der Entschädigung
es: Los datos de contacto correctos ayudan con la compensación
pl: Poprawne dane kontaktowe pomagają w uzyskaniu odszkodowania
pt: Dados de contato corretos ajudam com a compensação

source: Full Name
de: Vollständiger Name
es: Nombre Completo
fr: Nom complet
pl: Pełne imię i nazwisko
pt: Nome Completo

source: Attach Documents
de: Dokumente anhängen
es: Adjuntar Documentos
fr: Joindre des documents
pl: Dołącz dokumenty
pt: Anexar Documentos

source: Uploading document...
de: Dokument wird hochgeladen...
es: Subiendo documento...
fr: Téléchargement du document...
pl: Przesyłanie dokumentu...
pt: Enviando documento...

# noDocuments
source: No documents uploaded yet
de: Sie haben keine Dokumente.
es: No tienes documentos.
fr: Aucun document téléchargé pour le moment
pl: Nie masz żadnych dokumentów.
pt: Você não tem documentos.

source: Upload First Document
de: Erstes Dokument hochladen
es: Subir Primer Documento
fr: Télécharger le premier document
pl: Prześlij pierwszy dokument
pt: Enviar Primeiro Documento

source: Upload New
de: Neu hochladen
es: Subir Nuevo
fr: Télécharger un nouveau document
pl: Prześlij nowy
pt: Enviar Novo

# documentUploadSuccess
source: Document uploaded successfully
de: Dokument erfolgreich hochgeladen!
es: ¡Documento subido exitosamente!
fr: Le document a été téléchargé avec succès
pl: Dokument został pomyślnie przesłany!
pt: Documento enviado com sucesso!

# uploadFailed
source: Upload failed. Please try again.
de: Hochladen fehlgeschlagen. Bitte versuchen Sie es erneut.
es: Error al subir. Por favor, intenta de nuevo.
fr: Le téléchargement a échoué. Veuillez réessayer.
pl: Przesyłanie nie powiodło się. Spróbuj ponownie.
pt: Falha no envio. Por favor, tente novamente.

# continueAction
source: Continue
de: Weiter
es: Continuar
fr: Continuer
pl: Kontynuuj
pt: Continuar

source: Claim Attachment
de: Forderungsanhang
es: Adjunto de Reclamo
fr: Pièce jointe à la réclamation
pl: Załącznik do roszczenia
pt: Anexo de Reclamação

source: Other
de: andere
es: otro
fr: autre
pl: inny
pt: outro

source: Review Your Claim
de: Prüfen Sie Ihren Anspruch
es: Revise su reclamación
fr: Examiner Votre Réclamation
pl: Krok 1: Przejrzyj swoją reklamację
pt: Rever a Sua Reclamação

source: Review Claim Details
de: Prüfen Sie die Anspruchsdetails
es: Revise los detalles de la reclamación
fr: Examiner les Détails de la Réclamation
pl: Proszę przejrzeć szczegóły reklamacji przed kontynuacją.
pt: Rever Detalhes da Reclamação

source: Attachments
de: Anlagen
es: Archivos adjuntos
fr: Pièces Jointes
pl: Załączniki:
pt: Anexos

source: Proceed to Confirmation
de: Weiter zur Bestätigung
es: Proceder a confirmación
fr: Procéder à la Confirmation
pl: Przejdź do potwierdzenia
pt: Prosseguir para Confirmação

source: Confirm and Send
de: Bestätigen und senden
es: Confirmar y enviar
fr: Confirmer et Envoyer
pl: Krok 2: Potwierdź i Wyślij
pt: Confirmar e Enviar

source: Error loading email details
de: Fehler beim Laden der E-Mail-Details
es: Error al cargar los detalles del correo electrónico
fr: Erreur lors du chargement des détails de l'email
pl: Błąd: Nie można załadować szczegółów e-mail.
pt: Erro ao carregar detalhes do email

# noEmailInfo
source: No email information available
de: Keine E-Mail-Informationen verfügbar
es: No hay información de correo electrónico disponible
fr: Aucune information d'email disponible
pl: Nie można znaleźć informacji e-mail dla użytkownika lub linii lotniczej.
pt: Nenhuma informação de email disponível

source: Final Confirmation
de: Abschließende Bestätigung
es: Confirmación final
fr: Confirmation Finale
pl: Ostateczne potwierdzenie
pt: Confirmação Final

# claimWillBeSentTo
source: Your claim will be sent to:
de: Ihr Anspruch wird gesendet an
es: Su reclamación se enviará a
fr: Votre réclamation sera envoyée à :
pl: Reklamacja zostanie wysłana do:
pt: A sua reclamação será enviada para:

# copyToYourEmail
source: A copy will be sent to your email:
de: Kopie an Ihre E-Mail
es: Copia a su correo electrónico
fr: Une copie sera envoyée à votre email :
pl: Kopia zostanie wysłana na Twój e-mail:
pt: Uma cópia será enviada para o seu email:

source: Confirm and Send Email
de: Bestätigen und E-Mail senden
es: Confirmar y enviar correo electrónico
fr: Confirmer et Envoyer l'Email
pl: Potwierdź i wyślij e-mail
pt: Confirmar e Enviar Email

# emailAppOpenedMessage
source: Your email app has been opened
de: E-Mail-App geöffnet
es: Aplicación de correo electrónico abierta
fr: Votre application email a été ouverte
pl: Aplikacja e-mail została otwarta. Prosimy o wysłanie e-maila w celu finalizacji reklamacji.
pt: A sua aplicação de email foi aberta

# quickClaimTitle
source: Quick Claim Form
de: Schnellanspruch
es: Reclamación rápida
fr: Réclamation rapide
pl: Szybkie zgłoszenie
pt: Formulário de reclamação rápida

# quickClaimInfoBanner
source: Fill out this form to submit a quick compensation claim for your flight. We'll help you through the process.
de: Für EU-berechtigte Flüge. Füllen Sie grundlegende Informationen für eine schnelle Vorabprüfung aus.
es: Complete los detalles de su vuelo para verificar la elegibilidad para compensación
fr: Remplissez ce formulaire pour soumettre rapidement une demande d’indemnisation pour votre vol. Nous vous guiderons tout au long du processus.
pl: Dla lotów objętych przepisami UE. Wprowadź podstawowe informacje do wstępnej weryfikacji.
pt: Preencha este formulário para enviar rapidamente uma reclamação de compensação pelo seu voo. Vamos ajudar você no processo.

# flightNumberHintQuickClaim
source: Enter flight number (e.g. LH123)
de: z.B. LH123
es: Número de vuelo (ej. LH123)
fr: Entrez le numéro de vol (par exemple LH123)
pl: Zwykle 2-literowy kod linii lotniczej i cyfry, np. LH1234
pt: Digite o número do voo (ex.: LH123)

# tooltipFlightNumberQuickClaim
source: Enter the flight number for your claim
de: Geben Sie die Flugnummer ein, z.B. LH123
es: Introduzca el número de vuelo, p.ej. IB123
fr: Saisissez le numéro de vol de votre réclamation
pl: Wprowadź numer lotu tak, jak widnieje na bilecie lub rezerwacji
pt: Informe o número do voo para sua reclamação

# tooltipFlightDateQuickClaim
source: Select the date of your flight
de: Wählen Sie das Datum Ihres Fluges
es: Seleccione la fecha de su vuelo
fr: Sélectionnez la date de votre vol
pl: Data planowanego odlotu twojego lotu
pt: Selecione a data do seu voo

# departureAirportHintQuickClaim
source: Enter airport code or name (e.g. LHR, London Heathrow)
de: z.B. FRA
es: Aeropuerto de salida (ej. MAD)
fr: Entrez le code ou le nom de l’aéroport (ex. LHR, London Heathrow)
pl: np. FRA dla Frankfurtu, LHR dla Londynu Heathrow
pt: Digite o código ou nome do aeroporto (ex.: LHR, London Heathrow)

# tooltipDepartureAirportQuickClaim
source: Enter the airport you departed from
de: Geben Sie den 3-stelligen IATA-Code für den Abflughafen ein
es: Introduzca el código IATA de 3 letras del aeropuerto de salida
fr: Entrez l'aéroport de départ
pl: Wprowadź 3-literowy kod IATA dla lotniska wylotu
pt: Informe o aeroporto de partida

# arrivalAirportHintQuickClaim
source: Enter airport code or name (e.g. LHR, London Heathrow)
de: z.B. LHR
es: Aeropuerto de llegada (ej. BCN)
fr: Entrez le code ou le nom de l'aéroport d'arrivée (par exemple LHR, Londres Heathrow)
pl: np. JFK dla Nowego Jorku, CDG dla Paryża
pt: Digite o código ou nome do aeroporto (ex.: LHR, London Heathrow)

# tooltipArrivalAirportQuickClaim
source: Enter the airport you arrived at
de: Ankunftsflughafen für Quick Claim
es: Introduzca el código IATA de 3 letras del aeropuerto de llegada
fr: Entrez l'aéroport d'arrivée
pl: Wprowadź 3-literowy kod IATA dla lotniska przylotu
pt: Informe o aeroporto de chegada

# reasonForClaimLabel
source: Reason for Claim
de: Grund für den Anspruch
es: Motivo de la reclamación
fr: Motif de la réclamation
pl: Powód roszczenia
pt: Motivo da Reclamação

# hintTextReasonQuickClaim
source: Describe your claim reason here
de: z.B. Verspätung über 3 Stunden
es: p.ej. Retraso de más de 3 horas
fr: Décrivez ici le motif de votre réclamation
pl: Podaj powód roszczenia: opóźnienie, odwołanie, odmowa wejścia na pokład, itp.
pt: Descreva aqui o motivo da sua reclamação

# reasonForClaimHint
source: Describe why you are making this claim
de: z.B. Verspätung, Annullierung
es: Ej. retraso, cancelación
fr: Décrivez la raison de votre réclamation
pl: Podaj szczegóły dotyczące tego, co stało się z twoim lotem
pt: Descreva porque está a apresentar esta reclamação

# tooltipReasonQuickClaim
source: Explain why you believe you are entitled to compensation
de: Beschreiben Sie kurz, warum Sie einen Anspruch einreichen
es: Describa brevemente por qué está presentando una reclamación
fr: Expliquez pourquoi vous pensez avoir droit à une indemnisation
pl: Wyjaśnij szczegółowo powód swojego roszczenia
pt: Explique porque considera ter direito a indemnização

# compensationAmountOptionalLabel
source: Requested Compensation Amount (Optional)
de: Entschädigungsbetrag (optional)
es: Cantidad de compensación (opcional)
fr: Montant d'indemnisation demandé (facultatif)
pl: Kwota odszkodowania (opcjonalnie)
pt: Valor de compensação solicitado (opcional)

# compensationAmountHint
source: Enter amount if you have a specific request
de: z.B. 250€
es: Ej. 250€
fr: Entrez le montant si vous avez une demande spécifique
pl: Jeśli znasz kwotę, do której jesteś uprawniony, wprowadź ją tutaj
pt: Informe um valor se tiver um pedido específico

# tooltipCompensationAmountQuickClaim
source: You can specify a compensation amount or leave it blank
de: Geben Sie den Betrag ein, wenn Sie wissen, wofür Sie berechtigt sind
es: Introduzca la cantidad si conoce a cuánto tiene derecho
fr: Vous pouvez spécifier un montant d'indemnisation ou le laisser vide
pl: Wprowadź kwotę, jeśli wiesz, do czego jesteś uprawniony
pt: Você pode informar um valor de compensação ou deixar em branco

# tipsAndRemindersTitle
source: Tips & Reminders
de: Tipps & Erinnerungen
es: Consejos y recordatorios
fr: Conseils et rappels
pl: Wskazówki i przypomnienia
pt: Dicas e lembretes

# tipSecureData
source: Your data is secure and encrypted
de: Wir schützen Ihre Daten mit Bankstandard-Verschlüsselung
es: Protegemos sus datos con cifrado de nivel bancario
fr: Vos données sont sécurisées et chiffrées
pl: Twoje dane są bezpieczne i zaszyfrowane.
pt: Seus dados são seguros e criptografados

source: Preview Email
de: E-Mail-Vorschau
es: Vista previa de correo electrónico
fr: Aperçu de l'Email
pl: Podgląd e-mail
pt: Pré-visualizar Email

# pdfPreviewMessage
source: PDF Preview
de: PDF-Vorschau
es: Vista previa de PDF
fr: Aperçu du PDF
pl: Tutaj zostanie wyświetlony podgląd PDF.
pt: Prévia do PDF

source: Download PDF
de: PDF herunterladen
es: Descargar PDF
fr: Télécharger le PDF
pl: Pobierz PDF
pt: Baixar PDF

source: Pre-fill Compensation Form
fr: Pré-remplir le formulaire d'indemnisation
pl: Wypełnij formularz automatycznie
pt: Pré-preencher Formulário de Compensação

source: File preview not available
de: Datevorschau nicht verfügbar
es: Vista previa de archivo no disponible
fr: Aperçu du fichier non disponible
pl: Podgląd pliku niedostępny
pt: Pré-visualização do arquivo não disponível

source: Delete Document
de: Dokument löschen
es: Eliminar documento
fr: Supprimer le document
pl: Usuń dokument
pt: Excluir documento

# deleteDocumentConfirmation
source: Are you sure you want to delete this document?
de: Sind Sie sicher, dass Sie dieses Dokument löschen möchten?
es: ¿Está seguro de que desea eliminar este documento?
fr: Voulez-vous vraiment supprimer ce document ?
pl: Czy na pewno chcesz usunąć ten dokument?
pt: Tem certeza de que deseja excluir este documento?

# documentDeletedSuccess
source: Document deleted successfully
de: Dokument erfolgreich gelöscht
es: Documento eliminado con éxito
fr: Document supprimé avec succès
pl: Dokument został pomyślnie usunięty
pt: Documento excluído com sucesso

# documentDeleteFailed
source: Failed to delete document
de: Dokument konnte nicht gelöscht werden
es: Error al eliminar el documento
fr: Échec de la suppression du document
pl: Nie udało się usunąć dokumentu
pt: Falha ao excluir documento

source: Error
de: Fehler
pl: Błąd

# toLabel
source: To:
pl: Do

source: Potential Compensation
de: Mögliche Entschädigung:
es: Compensación Potencial:
fr: Indemnisation Potentielle
pl: Potencjalne odszkodowanie:
pt: Compensação Potencial

# scheduledLabel
source: Scheduled:
de: Geplant
es: Programado
fr: Prévu :
pl: Zaplanowany
pt: Programado:

# aircraftLabel
source: Aircraft:
fr: Aéronef:
pl: Samolot:
pt: Aeronave:

# flightNotFoundError
source: Flight not found
fr: Vol non trouvé. Veuillez vérifier votre numéro de vol et réessayer.
pl: Lot nie znaleziony. Proszę sprawdzić numer lotu i spróbować ponownie.
pt: Voo não encontrado. Por favor, verifique o número do voo e tente novamente.

# invalidFlightNumberError
source: Invalid flight number
fr: Format de numéro de vol invalide. Veuillez saisir un numéro de vol valide (ex. BA123, LH456).
pl: Nieprawidłowy format numeru lotu. Proszę wprowadzić prawidłowy numer lotu (np. BA123, LH456).
pt: Formato de número de voo inválido. Por favor, insira um número de voo válido (ex. BA123, LH456).

# networkTimeoutError
source: Network timeout, please try again
fr: Délai de connexion dépassé. Veuillez vérifier votre connexion Internet et réessayer.
pl: Przekroczono limit czasu połączenia. Proszę sprawdzić połączenie internetowe i spróbować ponownie.
pt: Tempo limite de conexão excedido. Por favor, verifique sua conexão com a internet e tente novamente.

source: Server error
fr: Serveur temporairement indisponible. Veuillez réessayer plus tard.
pl: Serwer tymczasowo niedostępny. Proszę spróbować później.
pt: Servidor temporariamente indisponível. Por favor, tente mais tarde.

# rateLimitError
source: Too many requests, please try again later
fr: Trop de requêtes. Veuillez patienter un moment et réessayer.
pl: Zbyt wiele żądań. Proszę poczekać chwilę i spróbować ponownie.
pt: Muitas solicitações. Por favor, aguarde um momento e tente novamente.

# generalFlightCheckError
source: Error checking flight eligibility
fr: Impossible de vérifier les informations de vol. Veuillez vérifier les détails de votre vol et réessayer.
pl: Nie można sprawdzić informacji o locie. Proszę zweryfikować dane lotu i spróbować ponownie.
pt: Não foi possível verificar as informações do voo. Verifique os dados do voo e tente novamente.

source: Flight Might Not Be Eligible
fr: Selon les données disponibles, votre vol pourrait ne pas être éligible à une compensation.
pl: Na podstawie dostępnych danych, Twój lot może nie kwalifikować się do odszkodowania.
pt: Com base nos dados disponíveis, seu voo pode não ser elegível para compensação.

source: Airline Data Disclaimer
fr: Les compagnies aériennes sous-estiment parfois les retards ou modifient les statuts de vol. Si vous avez subi un retard de 3+ heures, une annulation ou un détournement, vous pourriez encore avoir droit à une compensation.
pl: Linie lotnicze czasami zaniżają opóźnienia lub zmieniają statusy lotów. Jeśli doświadczyłeś opóźnienia 3+ godzin, odwołania lub przekierowania, nadal możesz być uprawniony do odszkodowania.
pt: As companhias aéreas às vezes subestimam atrasos ou alteram status de voos. Se você experimentou um atraso de 3+ horas, cancelamento ou desvio, ainda pode ter direito à compensação.

source: Submit Claim Anyway
fr: Soumettre une Réclamation Quand Même
pl: Złóż Roszczenie Mimo To
pt: Enviar Reclamação Mesmo Assim

source: Know Your Rights
fr: Connaissez Vos Droits
pl: Poznaj Swoje Prawa
pt: Conheça Seus Direitos

source: EU261 Rights
fr: Sous le règlement EU261, vous avez droit à une compensation pour : • Retards de 3+ heures • Annulations de vol • Refus d'embarquement • Détournements de vol
pl: Zgodnie z rozporządzeniem EU261, przysługuje Ci odszkodowanie za: • Opóźnienia 3+ godzin • Odwołania lotów • Odmowę wejścia na pokład • Przekierowania lotów
pt: Sob o regulamento EU261, você tem direito à compensação por: • Atrasos de 3+ horas • Cancelamentos de voos • Negação de embarque • Desvios de voos

source: Don't Let Airlines Win
fr: Ne laissez pas les compagnies aériennes éviter de payer ce que vous méritez !
pl: Nie pozwól liniom lotniczym uniknąć płacenia tego, co Ci się należy!
pt: Não deixe as companhias aéreas evitarem pagar o que você merece!

# checkFlightEligibilityButtonText
source: Check Flight Eligibility
fr: Vérifier l'éligibilité à l'indemnisation
pl: Sprawdź uprawnienie do odszkodowania
pt: Verificar elegibilidade para compensação

# euEligibleFlightsButtonText
source: EU Eligible Flights
fr: Vols éligibles à l'indemnisation dans l'UE
pl: Loty kwalifikujące się do odszkodowania w UE
pt: Voos elegíveis para compensação na UE

source: EU Compensation
fr: Indemnisation UE
pl: Kompensacja UE
pt: Compensação UE

source: minutes
pl: minut
pt: minutos

# errorFailedToSubmitClaim
source: Failed to submit claim. Please try again.
de: Fehler beim Einreichen des Anspruchs
es: Error al enviar la reclamación
fr: Échec de la soumission de la réclamation. Veuillez réessayer.
pl: TODO: Translate 'Failed to submit claim. Please try again.'
pt: Falha ao submeter reclamação. Tente novamente.
