Repository: PiotrStyla/Air24-MiniApp
Catalog: lib/l10n/app_*.arb
Languages: pl, pt

# appTitle
source: Flight Compensation
pl: Odszkodowania Lotnicze
pt: Compensação de Voo

# welcomeMessage
source: Welcome to Flight Compensation
pl: Witamy w aplikacji Odszkodowania Lotnicze
pt: Bem-vindo à Compensação de Voo

source: Search Flights
pl: Wyszukaj Loty
pt: Buscar Voos

source: Upload Documents
pl: Prześlij Dokumenty
pt: Carregar Documentos

source: Check Compensation
pl: Sprawdź Odszkodowanie

source: Submit Claim
pl: Złóż Wniosek
pt: Enviar Solicitação

source: Settings
pl: Ustawienia
pt: Configurações

source: Home
pl: Strona Główna
pt: Início

source: Claims
pl: Wnioski
pt: Reclamações

# languageSelection
source: Language
pl: Język
pt: Idioma

source: Back
pl: Wstecz
pt: Voltar

source: Save
pl: Zapisz

source: Cancel
pl: Anuluj

source: Next
pl: Dalej

source: Previous
pl: Poprzedni

source: Yes
pl: Tak

source: No
pl: Nie

# arrivalsAt
source: Arrivals at {airport}
pl: Przyloty na {airport}
pt: Chegadas em {airport}

source: Filter by airline
pl: Filtruj według linii lotniczej
pt: Filtrar por companhia aérea

# flightStatusDelayed
source: Delayed
pl: Opóźniony
pt: Atrasado

# flightStatusCancelled
source: Cancelled
pl: Odwołany
pt: Cancelado

# flightStatusDiverted
source: Diverted
pl: Przekierowany
pt: Desviado

# flightStatusOnTime
source: On time
pl: Na czas
pt: No horário

source: Flight
pl: Lot

source: Flights
pl: Loty

source: My Flights
pl: Moje Loty
pt: Meus Voos

source: Find Flight
pl: Znajdź Lot

source: Flight Number
pl: Numer Lotu
pt: Número do Voo

source: Departure Airport
pl: Lotnisko Odlotu
pt: Aeroporto de Partida

source: Arrival Airport
pl: Lotnisko Przylotu
pt: Aeroporto de Chegada

source: Flight Date
pl: Data Lotu
pt: Data do Voo

# checkCompensationEligibility
source: Check Flight Compensation Eligibility
pl: Sprawdź Uprawnienia do Odszkodowania
pt: Verificar Elegibilidade para Compensação

source: Supporting Documents
pl: Dokumenty Potwierdzające
pt: Documentos de Suporte

# supportingDocumentsHint
source: Attach boarding passes, tickets, and other documents to strengthen your claim.
pl: Załącz karty pokładowe, bilety i inne dokumenty, aby wzmocnić swój wniosek.
pt: Anexe cartões de embarque, bilhetes e outros documentos para fortalecer a sua reclamação.

source: Add Document
pl: Dodaj Dokument

source: Scan Document
pl: Skanuj Dokument

source: Upload Document
pl: Prześlij Dokument

# scanDocumentHint
source: Use camera to auto-fill form
pl: Użyj aparatu do automatycznego wypełnienia formularza

# uploadDocumentHint
source: Select from device storage
pl: Wybierz z pamięci urządzenia

# noDocumentsYet
source: No documents attached yet
pl: Nie załączono jeszcze żadnych dokumentów

# enterFlightNumberFirst
source: Please enter a flight number first
pl: Najpierw wprowadź numer lotu

source: View All
pl: Zobacz Wszystkie

source: Document Scanner
pl: Skaner Dokumentów

# tipAccessibilitySettings
source: Check the Accessibility Settings to customize the app for your needs.
pl: Sprawdź Ustawienia Dostępności, aby dostosować aplikację do swoich potrzeb.
pt: Verifique as Configurações de Acessibilidade para personalizar a aplicação às suas necessidades.

source: Account Settings
pl: Ustawienia Konta
pt: Configurações da Conta

source: Profile Information
pl: Informacje Profilu

# editPersonalInformation
source: Edit your personal information
pl: Edytuj swoje dane osobowe

# editPersonalAndContactInformation
source: Edit your personal and contact information
pl: Edytuj swoje dane osobowe i kontaktowe

# configureAccessibilityOptions
source: Configure accessibility options for the app
pl: Skonfiguruj opcje dostępności dla aplikacji

source: Accessibility Options
pl: Opcje Dostępności
pt: Opções de Acessibilidade

source: Configure high contrast, large text, and screen reader support
pl: Skonfiguruj wysoki kontrast, duży tekst i obsługę czytnika ekranu

source: Application Preferences
pl: Preferencje Aplikacji

source: Notification Settings
pl: Ustawienia Powiadomień

source: Configure notification preferences
pl: Skonfiguruj preferencje powiadomień

source: Configure how you receive claim updates
pl: Skonfiguruj sposób otrzymywania aktualizacji wniosków

source: Language
pl: Język

source: Change application language
pl: Zmień język aplikacji

source: Select your preferred language
pl: Wybierz preferowany język

# tipsAndReminders
source: Tips & Reminders
pl: Wskazówki i Przypomnienia

# importantTipsAboutProfileInformation
source: Important tips about your profile information
pl: Ważne wskazówki dotyczące informacji w profilu

# tipProfileUpToDate
source: Keep your profile up to date for smooth claim processing.
pl: Utrzymuj swój profil na bieżąco dla płynnego przetwarzania wniosków.
pt: Mantenha o seu perfil atualizado para um processamento tranquilo das reclamações.

# tipInformationPrivate
source: Your information is private and only used for compensation claims.
pl: Twoje informacje są prywatne i używane tylko do wniosków o odszkodowanie.
pt: A sua informação é privada e usada apenas para reclamações de compensação.

# tipContactDetails
source: Make sure your contact details are correct so we can reach you about your claim.
pl: Upewnij się, że dane kontaktowe są poprawne, abyśmy mogli skontaktować się z Tobą w sprawie wniosku.
pt: Certifique-se de que os seus detalhes de contacto estão corretos para que possamos contactá-lo sobre a sua reclamação.

# profileInfoCardTitle
source: Your profile contains your personal and contact information. This is used to process your flight compensation claims and keep you updated.
pl: Twój profil zawiera dane osobowe i kontaktowe. Są one używane do przetwarzania wniosków o odszkodowanie lotnicze i informowania Cię o postępach.
pt: O seu perfil contém as suas informações pessoais e de contacto. Esta informação é usada para processar as suas reclamações de compensação de voo e mantê-lo atualizado.

# noClaimsYetTitle
source: No Claims Yet
pl: Brak Wniosków

# noClaimsYetSubtitle
source: Start your compensation claim by selecting a flight from the EU Eligible Flights section
pl: Rozpocznij swój wniosek o odszkodowanie wybierając lot z sekcji Loty Kwalifikujące się do UE

# extractingText
source: Extracting text and identifying fields
pl: Wyodrębnianie tekstu i identyfikacja pól

# scanInstructions
source: Position your document within the frame and take a photo
pl: Umieść dokument w ramce i zrób zdjęcie

# formFilledWithScannedData
source: Form filled with scanned document data
pl: Formularz wypełniony danymi z zeskanowanego dokumentu

source: Flight Details
pl: Szczegóły Lotu
pt: Detalhes do Voo

source: Passenger Details
pl: Dane Pasażera
pt: Detalhes do Passageiro

source: Airline
pl: Linia Lotnicza
pt: Companhia Aérea

source: Booking Reference
pl: Numer Rezerwacji
pt: Referência da Reserva

source: Passenger Name
pl: Imię i Nazwisko Pasażera

source: Phone Number
pl: Numer Telefonu

source: Additional Information
pl: Dodatkowe Informacje
pt: Informação Adicional

source: Required
pl: Wymagane

source: Optional
pl: Opcjonalne
pt: Opcional

source: Submit
pl: Wyślij

source: Submission Checklist
pl: Lista Kontrolna Wysyłki
pt: Lista de Verificação da Submissão

source: Document attached
pl: Dokument załączony

# completeAllFields
source: Please complete all required fields and attach documents
pl: Wypełnij wszystkie wymagane pola i załącz dokumenty

source: This field is required
pl: To pole jest wymagane

source: Claim submitted successfully
pl: Wniosek został pomyślnie wysłany

source: Compensation Claim Form
pl: Formularz Wniosku o Odszkodowanie
pt: Formulário de Pedido de Compensação

# prefilledFromProfile
source: Pre-filled from your profile
pl: Wstępnie wypełnione z Twojego profilu

source: Uploaded
pl: Przesłano

source: Scanned
pl: Zeskanowano

source: Crop Document
pl: Przytnij Dokument
pt: Recortar Documento

source: Crop
pl: Przytnij
pt: Recortar

source: Rotate
pl: Obróć
pt: Girar

source: Aspect Ratio
pl: Proporcje
pt: Proporção

# adjustDocument
source: Adjust document boundaries
pl: Dostosuj granice dokumentu
pt: Ajustar bordas do documento

source: Cropping...
pl: Przycinanie...
pt: Recortando...

# aspectRatioFree
source: Free Form
pl: Dowolne
pt: Formato Livre

# aspectRatioSquare
source: Square (1:1)
pl: Kwadrat (1:1)
pt: Quadrado (1:1)

# aspectRatioPortrait
source: Portrait (3:4)
pl: Portret (3:4)
pt: Retrato (3:4)

# aspectRatioLandscape
source: Landscape (4:3)
pl: Krajobraz (4:3)
pt: Paisagem (4:3)

source: Aspect Ratio: {mode}
pl: Proporcje: {mode}
pt: Proporção: {mode}

# documentOcrResult
source: Document Analysis Result
pl: Wynik Analizy Dokumentu
pt: Resultado da Análise do Documento

source: Extracted Fields
pl: Wyodrębnione Pola
pt: Campos Extraídos

source: Full Text
pl: Pełny Tekst
pt: Texto Completo

source: Document saved
pl: Dokument zapisany
pt: Documento salvo

source: Use Extracted Data
pl: Użyj Wyodrębnionych Danych
pt: Usar Dados Extraídos

source: Processing document...
pl: Przetwarzanie dokumentu...

source: Copy to Clipboard
pl: Kopiuj do Schowka
pt: Copiar para Área de Transferência

# textCopied
source: Text copied to clipboard
pl: Tekst skopiowany do schowka
pt: Texto copiado para a área de transferência

source: Document Type
pl: Typ Dokumentu
pt: Tipo de Documento

source: Save Document
pl: Zapisz Dokument
pt: Salvar Documento

source: Field Name
pl: Nazwa Pola
pt: Nome do Campo

# fieldValue
source: Value
pl: Wartość
pt: Valor

# noFieldsExtracted
source: No fields were extracted from this document
pl: Nie wyodrębniono żadnych pól z tego dokumentu
pt: Nenhum campo foi extraído deste documento

source: Extracted Information
pl: Wyodrębnione Informacje
pt: Informações Extraídas

source: Raw OCR Text
pl: Surowy Tekst OCR
pt: Texto OCR Bruto

source: Copy all text
pl: Kopiuj cały tekst
pt: Copiar todo o texto

source: Copied to clipboard
pl: Skopiowano do schowka
pt: Copiado para a área de transferência

source: Fill Form
pl: Wypełnij Formularz
pt: Preencher Formulário

# chooseUseInfo
source: Choose where to use this information:
pl: Wybierz, gdzie użyć tych informacji:
pt: Escolha onde usar esta informação:

# fillPassengerFlight
source: Fill passenger and flight details
pl: Wypełnij dane pasażera i szczegóły lotu
pt: Preencher detalhes do passageiro e do voo

source: Flight Search
pl: Wyszukiwanie Lotów
pt: Busca de Voos

# searchFlightNumber
source: Search using flight number
pl: Wyszukaj używając numeru lotu
pt: Buscar usando número do voo

source: Done
pl: Gotowe
pt: Concluído

source: Delayed Flight Detected!
pl: Wykryto Opóźniony Lot!
pt: Voo Atrasado Detectado!

source: Flight Detected!
pl: Wykryto Lot!
pt: Voo Detectado!

# flightLabel
source: Flight: {number}
pl: Lot: {number}
pt: Voo: {number}

source: From: {airport}
pl: Z: {airport}
pt: De: {airport}

source: To: {airport}
pl: Do: {airport}
pt: Para: {airport}

# delayedEligible
source: This flight is delayed. You may be eligible for compensation.
pl: Ten lot jest opóźniony. Możesz być uprawniony do odszkodowania.
pt: Este voo está atrasado. Você pode ter direito a uma compensação.

source: Dismiss
pl: Odrzuć
pt: Fechar

source: Start Claim
pl: Rozpocznij Wniosek
pt: Iniciar Pedido

# pleaseEnterDepartureAirport
source: Please enter the departure airport
pl: Wprowadź lotnisko odlotu
pt: Por favor, insira o aeroporto de partida

source: Required Fields Completed
pl: Wymagane Pola Wypełnione
pt: Campos obrigatórios preenchidos

# scanningDocumentsNote
source: Note: Scanning documents will automatically extract information to help fill your claim form.
pl: Uwaga: Skanowanie dokumentów automatycznie wyodrębni informacje, które pomogą wypełnić formularz wniosku.
pt: Nota: A digitalização de documentos extrairá automaticamente informações para ajudar a preencher seu formulário de solicitação.

# formSubmissionError
source: Error submitting form: {message}
pl: Błąd wysyłania formularza: {message}
pt: Erro ao enviar formulário: {message}

# networkError
source: Network error. Please check your connection and try again.
pl: Błąd sieci. Sprawdź połączenie i spróbuj ponownie.
pt: Erro de rede. Verifique sua conexão e tente novamente.

# generalError
source: An error occurred. Please try again later.
pl: Wystąpił błąd. Spróbuj ponownie później.
pt: Ocorreu um erro. Por favor, tente novamente mais tarde.

# loginRequiredForClaim
source: You must be logged in to submit a claim
pl: Musisz być zalogowany, aby złożyć wniosek
pt: Você deve estar logado para enviar uma solicitação

# errorConnectionFailed
source: Connection failed. Please check your internet connection.
pl: Połączenie nieudane. Sprawdź połączenie internetowe.
pt: Falha na conexão. Verifique sua conexão com a internet.

# errorApiLimitExceeded
source: API request limit exceeded. Please try again later.
pl: Przekroczono limit żądań API. Spróbuj ponownie później.
pt: Limite de requisições da API excedido. Tente novamente mais tarde.

# errorGeneric
source: An error occurred. Please try again.
pl: Wystąpił błąd. Spróbuj ponownie.
pt: Ocorreu um erro. Tente novamente.

# documentTypePassport
source: Passport
pl: Paszport
pt: Passaporte

# documentTypeBoardingPass
source: Boarding Pass
pl: Karta Pokładowa
pt: Cartão de embarque

# documentTypeFlightTicket
source: Flight Ticket
pl: Bilet Lotniczy
pt: Bilhete aéreo

# documentTypeReceipt
source: Receipt
pl: Paragon
pt: Recibo

# saveButton
source: Save
pl: Zapisz
pt: Salvar

# cancelButton
source: Cancel
pl: Anuluj
pt: Cancelar

source: EU Compensation Eligible
pl: Kwalifikuje się do Odszkodowania UE
pt: Voos Elegíveis para Compensação na UE

# euWideEligibleFlights
source: EU-Wide Compensation Eligible Flights
pl: Loty kwalifikujące się do odszkodowania w całej UE
pt: Voos Elegíveis para Compensação em Toda a UE

# configureAccessibilityDescription
source: Configure high contrast, large text, and screen reader support
pl: Ustaw wysoki kontrast, powiększone teksty i czytanie ekranu
pt: Configure o alto contraste, texto grande e suporte para leitor de ecrã

# configureNotificationsDescription
source: Configure how you receive claim updates
pl: Ustaw sposób otrzymywania powiadomień o statusie roszczeń
pt: Configure como recebe as atualizações das reclamações

source: Active
pl: Aktywne
pt: Ativas

source: Action Required
pl: Wymagane Działanie
pt: Ação Requerida

source: Completed
pl: Zakończone
pt: Concluídas

source: No Claims Yet
pl: Brak Roszczeń
pt: Ainda Não Há Reclamações

# createClaim
source: Create a Claim
pl: Utwórz roszczenie
pt: Criar Reclamação

# startCompensationClaimInstructions
source: Start your compensation claim by selecting a flight from the EU Eligible Flights section
pl: Wypełnij wniosek roszczenia odszkodowawczego wybierając lot z listy lotów potencjalnie kwalifikujących się do odszkodowania
pt: Inicie a sua reclamação de compensação selecionando um voo na secção Voos Elegíveis da UE

# quickClaimTitle
source: Quick Claim
pt: Reclamação Rápida

# quickClaimInfoBanner
source: Review and edit your flight claim details below. All required fields must be filled. Tap the info icons for help.
pt: Revise e edite os detalhes da sua reclamação de voo abaixo. Todos os campos obrigatórios devem ser preenchidos. Toque nos ícones de informação para obter ajuda.

# flightNumberHintQuickClaim
source: Usually a 2-letter airline code and digits, e.g. LH1234
pt: Normalmente um código de companhia aérea de 2 letras e dígitos, ex: LH1234

# departureAirportHintQuickClaim
source: e.g. FRA for Frankfurt, LHR for London Heathrow
pt: ex: FRA para Frankfurt, LHR para Londres Heathrow

# arrivalAirportHintQuickClaim
source: e.g. JFK for New York, CDG for Paris
pt: ex: JFK para Nova Iorque, CDG para Paris

# reasonForClaimLabel
source: Reason *
pt: Motivo *

# reasonForClaimHint
source: State why you are claiming: delay, cancellation, denied boarding, etc.
pt: Indique o motivo da sua reclamação: atraso, cancelamento, embarque negado, etc.

# compensationAmountOptionalLabel
source: Compensation Amount (optional)
pt: Valor da Compensação (opcional)

# compensationAmountHint
source: If you know the amount you are eligible for, enter it here
pt: Se souber o valor a que tem direito, insira-o aqui

# euWideCompensationTitle
source: EU-wide Compensation
pt: Compensação em Toda a UE

# last144HoursButton
source: Last 144 hours
pt: Últimas 144 horas

# scheduledLabel
source: Scheduled:
pt: Programado:

# statusLabelEuList
source: Status:
pt: Estado:

# potentialCompensationLabel
source: Potential Compensation:
pt: Compensação Potencial:

# prefillCompensationFormButton
source: Pre-fill Compensation Form
pt: Pré-preencher Formulário de Compensação

# claimsTabActive
source: Active
pt: Ativas

# claimsTabActionRequired
source: Action Required
pt: Ação Necessária

# claimsTabCompleted
source: Completed
pt: Concluídas

# dialogTitleSuccess
source: Success
pt: Sucesso

# dialogContentClaimSubmitted
source: Your claim has been submitted!
pt: A sua reclamação foi submetida!

# errorMustBeLoggedIn
source: You must be logged in to submit a claim.
pt: Deve estar autenticado para submeter uma reclamação.

# errorFailedToSubmitClaim
source: Failed to submit claim. Please try again.
pt: Falha ao submeter a reclamação. Por favor, tente novamente.

# dialogTitleError
source: Error
pt: Erro

# validatorFlightNumberRequired
source: Flight number is required
pt: O número do voo é obrigatório

# tooltipFlightNumberQuickClaim
source: Enter your flight number as shown on your ticket or boarding pass.
pt: Insira o número do seu voo como mostrado no seu bilhete ou cartão de embarque.

# tooltipFlightDateQuickClaim
source: The date your flight departed or was scheduled to depart.
pt: A data em que o seu voo partiu ou estava programado para partir.

# validatorDepartureAirportRequired
source: Departure airport is required
pt: O aeroporto de partida é obrigatório

# tooltipDepartureAirportQuickClaim
source: Enter the IATA code of the airport where your flight started.
pt: Insira o código IATA do aeroporto onde o seu voo começou.

# validatorArrivalAirportRequired
source: Arrival airport is required
pt: O aeroporto de chegada é obrigatório

# tooltipArrivalAirportQuickClaim
source: Enter the IATA code of the airport where your flight landed.
pt: Insira o código IATA do aeroporto onde o seu voo aterrou.

# hintTextReasonQuickClaim
source: Reason (delay, cancellation, etc.)
pt: Motivo (atraso, cancelamento, etc.)

# validatorReasonRequired
source: Reason is required
pt: O motivo é obrigatório

# tooltipReasonQuickClaim
source: Describe the issue: e.g. delayed more than 3 hours, cancelled, overbooked.
pt: Descreva o problema: ex. atraso superior a 3 horas, cancelado, overbooking.

# tooltipCompensationAmountQuickClaim
source: Leave blank if unsure. Typical EU compensation: €250-€600 depending on distance.
pt: Deixe em branco se não tiver a certeza. Compensação típica da UE: €250-€600 dependendo da distância.

# tipsAndRemindersTitle
source: Tips & Reminders
pt: Dicas e Lembretes

# tipSecureData
source: • Your data is securely processed and only used for compensation claims.
pt: • Os seus dados são processados de forma segura e usados apenas para reclamações de compensação.

# tipCheckEligibility
source: • Make sure your flight is eligible for compensation (e.g., delay >3h, cancellation, denied boarding).
pt: • Certifique-se de que o seu voo é elegível para compensação (ex: atraso >3h, cancelamento, embarque negado).

# tipDoubleCheckDetails
source: • Double-check all details before submitting to avoid delays.
pt: • Verifique todos os detalhes antes de submeter para evitar atrasos.

# tooltipFaqHelp
source: FAQ & Help
pt: FAQ e Ajuda
